{
  "Header.Item1": "About Me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.Item5": "Chat",
  "Header.cvBtn": "Resume",
  "Header.cvName": "SIVA_CV.pdf",
  "Banner.Pretitle": "Hello! I am",
  "Banner.Description": "I have <span class='underline'>2 years of experience</span> in developing dynamic, responsive, and user-friendly web applications. My expertise lies in creating efficient systems, intuitive user interfaces, and innovative solutions to enhance web experiences. I am passionate about writing clean, reusable, and scalable code in <span class='underline'>Angular</span>, adhering to best practices and modern development standards to deliver high-quality front-end solutions. As a Full Stack Developer, I specialize in developing web applications using Angular, Spring Boot, and MySQL, ensuring seamless integration between front-end and back-end technologies to create efficient and dynamic user experiences.",
  "Banner.ActionBtn": "Say Hi",
  "AboutMe.Title": "About Me",
  "AboutMe.Paragraphs": [
    "In <span class='underline'>2 years of experience</span>  I have taken on various roles, including <span class='underline'>Frontend Development</span> and including <span class='underline'>Backend Development</span>, with a strong focus on Angular development. I am passionate about leveraging my expertise to create innovative solutions that address real-world problems.",
    "My skill set includes implementing system enhancements, optimizing Angular applications, standardizing UI/UX patterns, and proposing and executing ideas that bring tangible value to the projects I contribute to.",
    "I also program things for my personal use, whether for hobby or utility.",
    "Some of the technologies I work with include... (Feel free to complete this section with relevant technologies!):",
    "Additionally, I have experience in back-end development using Java Spring Boot to design robust, scalable, and secure REST APIs, enabling seamless communication between the client and server."
  ],
  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Oasys",
      "Title": "Software Developer",
      "Date": "Aug 2023 - Present",
      "Description": [
        "Driving technical decisions to ensure efficient frontend development using Angular.",
        "Contributing to the hiring process for frontend development talent.",
        "Leading and mentoring a team focused on Angular-based projects.",
        "Developing and maintaining a responsive and scalable web application for seamless user experience.",
        "Creating reusable components and custom directives to enhance Angular applications.",
        "Implementing continuous integration pipelines and ensuring application stability through automated tests and regular updates.",
        "Collaborating with stakeholders to plan and report on project progress and deliverables.",
        "Designing and developing secure, scalable, and high-performance REST APIs using Java Spring Boot to enable seamless interaction between the client and server.",
        "Integrating business logic into the back end by creating robust service layers and implementing database operations with MySQL/PostgreSQL.",
        "Optimizing server-side performance and ensuring high availability by managing API requests and load balancing.",
        "Implementing role-based access control and authentication mechanisms to secure back-end systems.",
        "Debugging, monitoring, and improving back-end systems to ensure reliable application performance."
      ]
    }
  ],
  "FeatureProjects.Title": "My Projects",
  "FeatureProjects.Label": "",
  "FeatureProjects.Projects": [
    {
      "Title": "CO-OPTEX",
      "Description": "Developing a web application to efficiently suggest and manage the <span class='underline'>COOPTEX</span> Retail Application, a comprehensive Enterprise Resource Planning (ERP) system. The application oversees the flow of supplies through all stages of the production cycle. This includes implementing robust back-end functionality using Java Spring Boot for managing business logic, ensuring seamless data flow, and creating secure REST APIs for integration across modules. Additionally, optimizing the front-end with Angular to deliver a responsive and user-friendly interface for streamlined operations.",
      "imgs": [
        "assets/images/coptex1.png",
        "assets/images/coptex2.png",
        "assets/images/coptex3.png",
        "assets/images/coptex4.png",
        "assets/images/coptex5.png"
      ],
      "Technologies": [
        "Angular 16",
        "TypeScript 5.2",
        "Angular Material",
        "Bootstrap",
        "RxJS",
        "Java",
        "Postgresql"
      ]
    },
    {
      "Title": "THE STELLA",
      "Description": "The <span class='underline'>Stella E-Commerce System</span> is a comprehensive and dynamic web-based application designed to revolutionize the online shopping experience. Built using Angular for the front end, it provides an interactive and user-friendly interface, ensuring seamless navigation and product discovery for customers. The back end, developed with Java Spring Boot, powers the system with secure REST APIs for efficient order management, payment processing, and inventory tracking. Designed as a freelance project, this solution enables businesses to showcase and sell their products online while optimizing backend processes like product catalog management, user authentication, and sales analytics.",
      "imgs": [
        "assets/images/stella1.png",
        "assets/images/stella3.png",
        "assets/images/stella4.png",
        "assets/images/stella5.png",
        "assets/images/stella2.png"
      ],
      "Technologies": [
        "Angular 18",
        "Angular Material",
        "Bootstrap",
        "TypeScript 5.5",
        "RxJS",
        "SpringBoot",
        "Core Java"      ]
    },
    {
      "Title": "Static Ecommerce",
      "Description": "The <span class='underline'>Stella E-Commerce System</span> is a comprehensive and dynamic web-based application designed to revolutionize the online shopping experience. Built using Angular for the front end.",
      "imgs": [
        "assets/images/static1.png",
        "assets/images/static2.png",
        "assets/images/static3.png",
        "assets/images/static4.png",
        "assets/images/static5.png"
      ],
      "Technologies": [
        "Angular 18",
        "Angular Material",
        "Bootstrap",
        "TypeScript 5.5",
        "RxJS"
      ]
    }
  ],
  "Contact.Pretitle": "And... Now?",
  "Contact.Title": "Say Hi!",
  "Contact.Content": "I will be glad to hear from you if you want to discuss new opportunities. Write to me, and I will respond as soon as I see your message.",
  "Contact.Btn": "Contact Me"
}