{
  "Header.Item1": "About Me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.Item5": "Chat",
  "Header.cvBtn": "Resume",
  "Header.cvName": "prathapRESUME.pdf",
  "Banner.Pretitle": "Hello! I am",
  "Banner.Description": "I am a backend-focused <span class='underline'>Software Developer</span> with <span class='underline'>2 years of experience</span> in building robust, scalable, and high-performance applications. My expertise lies in designing and developing RESTful APIs using <span class='underline'>Java Spring Boot</span>, optimizing database queries with <span class='underline'>MySQL & PostgreSQL</span>, and ensuring seamless integration between backend and frontend systems. Additionally, I have experience working with <span class='underline'>Node.js and MongoDB</span> for backend development. I am passionate about writing clean, reusable, and scalable code, following modern software development best practices.",
  "Banner.ActionBtn": "Say Hi",
  "AboutMe.Title": "About Me",
  "AboutMe.Paragraphs": [
    "With <span class='underline'>2 years of experience</span>, I specialize in backend development, focusing on designing scalable REST APIs, optimizing database performance, and integrating cloud-based deployments.",
    "I have hands-on experience in building and maintaining enterprise-grade applications using <span class='underline'>Java Spring Boot, MySQL, and PostgreSQL</span>. My work includes architecting secure backend services and implementing business logic for real-world applications.",
    "In addition to backend development, I have knowledge of <span class='underline'>Angular and front-end technologies</span>, allowing me to understand the full-stack workflow and optimize API interactions.",
    "I enjoy problem-solving, debugging, and continuously improving application performance to ensure efficiency and scalability.",
    "Technologies I work with include Java, Spring Boot, MySQL, PostgreSQL, Node.js, MongoDB, Angular, Docker, and Git."
  ],
  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Oasys",
      "Title": "Software Developer",
      "Date": "Aug 2023 - Present",
      "Description": [
        "Designed and developed RESTful APIs using Java Spring Boot to enable seamless client-server interactions.",
        "Optimized MySQL and PostgreSQL database queries to improve system performance and ensure efficient data retrieval.",
        "Built robust backend service layers to implement business logic for enterprise applications.",
        "Integrated Angular front-end with Spring Boot APIs, ensuring smooth communication between UI and backend systems.",
        "Implemented authentication and authorization mechanisms to enhance application security.",
        "Deployed applications using Docker and managed deployments on Render.",
        "Performed unit testing and debugging to maintain high software reliability and performance.",
        "Collaborated with cross-functional teams to define system requirements and deliver scalable backend solutions."
      ]
    }
  ],
  "FeatureProjects.Title": "My Projects",
  "FeatureProjects.Label": "",
  "FeatureProjects.Projects": [
    {
      "Title": "CO-OPTEX ERP System",
      "Description": "Developed a comprehensive <span class='underline'>Enterprise Resource Planning (ERP)</span> system for managing business operations across multiple departments. Designed and implemented <span class='underline'>RESTful APIs</span> using Java Spring Boot, ensuring smooth integration between inventory, sales, and finance modules. Optimized database performance using <span class='underline'>PostgreSQL</span> and enhanced user experience with an <span class='underline'>Angular</span> front end.",
      "imgs": [
        "assets/images/coptex1.png",
        "assets/images/coptex2.png",
        "assets/images/coptex3.png",
        "assets/images/coptex4.png",
        "assets/images/coptex5.png"
      ],
      "Technologies": [
        "Spring Boot",
        "Java",
        "PostgreSQL",
        "Angular",
        "TypeScript",
        "Bootstrap",
        "Docker"
      ]
    },
    {
      "Title": "ToDo Web App",
      "Description": "Developed a full-stack ToDo application using <span class='underline'>Node.js and Express.js</span> for the backend, implementing a secure REST API for CRUD operations. Utilized <span class='underline'>MongoDB</span> as the database and deployed the API on Render. Integrated an Angular-based front-end for a seamless user experience.",
      "imgs": [
        "assets/images/todo1.png",
        "assets/images/todo2.png",
        "assets/images/todo3.png",
        "assets/images/todo4.png"
      ],
      "Technologies": [
        "Node.js",
        "Express.js",
        "MongoDB",
        "Angular",
        "GitHub Pages",
        "Render"
      ]
    },
    {
      "Title": "E-Commerce API",
      "Description": "Built a scalable and secure REST API for an <span class='underline'>E-Commerce Platform</span>, enabling features like product management, order processing, and payment integration. Developed using <span class='underline'>Spring Boot</span> and secured with role-based authentication.",
      "imgs": [
        "assets/images/ecom1.png",
        "assets/images/ecom2.png",
        "assets/images/ecom3.png"
      ],
      "Technologies": [
        "Spring Boot",
        "Java",
        "MySQL",
        "Swagger",
        "Postman",
        "Docker"
      ]
    }
  ],
  "Contact.Pretitle": "What's Next?",
  "Contact.Title": "Let's Connect!",
  "Contact.Content": "I'm always open to discussing new opportunities, innovative projects, or collaboration. Feel free to reach out, and I'll respond as soon as possible.",
  "Contact.Btn": "Contact Me"
}
